{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\finaldata_unimputedfin",clear
{txt}
{com}. 
. 
. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\dates_fastingstatus",clear
{txt}
{com}. 
. 
. sort n_eid
{txt}
{com}. capture drop _merge
{txt}
{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\dates_fastingstatus.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\finaldata_unimputedfin",clear
{txt}
{com}. merge n_eid using "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\dates_fastingstatus"
{txt}{p}
(you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. ****************************************************************************************************
. 
. capture drop M1
{txt}
{com}. gen M1=zwfdc2
{txt}(497,469 missing values generated)

{com}. 
. capture drop M2
{txt}
{com}. gen M2=zgdf15
{txt}(497,099 missing values generated)

{com}. 
. capture drop FA
{txt}
{com}. gen FA=zFA_mean
{txt}(497,070 missing values generated)

{com}. 
. capture drop MD
{txt}
{com}. gen MD=zMD_mean
{txt}(497,070 missing values generated)

{com}. 
. capture drop ISOVF
{txt}
{com}. gen ISOVF=zISOVF_mean
{txt}(497,070 missing values generated)

{com}. 
. capture drop ICVF
{txt}
{com}. gen ICVF=zICVF_mean
{txt}(497,070 missing values generated)

{com}. 
. capture drop OD
{txt}
{com}. gen OD=zOD_mean
{txt}(497,070 missing values generated)

{com}. 
. 
. capture drop PD
{txt}
{com}. gen PD=poororalhealth_sev
{txt}(497,070 missing values generated)

{com}. 
. capture drop HS
{txt}
{com}. gen HS=householdsize
{txt}(497,070 missing values generated)

{com}. 
. capture drop LE8
{txt}
{com}. gen LE8=LE8_TOTALSCORE
{txt}(497,070 missing values generated)

{com}. 
. capture drop FASTING
{txt}
{com}. gen FASTING=p74_i0
{txt}(1,234 missing values generated)

{com}. 
. capture drop DATE0
{txt}
{com}. gen DATE0=p53_i0
{txt}(3 missing values generated)

{com}. 
. capture drop DATE0NUM
{txt}
{com}. gen double DATE0NUM = date(DATE0,"MDY")
{txt}(3 missing values generated)

{com}. 
. capture drop QUARTER0
{txt}
{com}. gen QUARTER0=quarter(DATE0NUM)
{txt}(3 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8C_PERIODONTALDISEASE_DMRI_PROTEOMICS\DATA\finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. *********************OVERALL***********
. 
. 
. **Fully adjusted model**
.  sem (QUARTER0 -> FA, ) (QUARTER0 -> MD, ) (QUARTER0 -> ISOVF, ) (QUARTER0 -> ICVF, ) (QUARTER0 -> OD, ) (QUARTER0 -> PROT, ) (QUARTER0 -> PD, ) (FASTING -> FA, ) (FASTING -> MD, ) (FASTING -> ISOVF, ) (FASTING -> ICVF, ) (FASTING -> OD, ) (FASTING -> PROT, ) (FASTING -> PD, ) (TIME_V0V2 -> FA, ) (TIME_V0V2 -> MD, ) (TIME_V0V2 -> ISOVF, ) (TIME_V0V2 -> ICVF, ) (TIME_V0V2 -> OD, ) (TIME_V0V2 -> PROT, ) (TIME_V0V2 -> PD, ) (AGE -> FA, ) (AGE -> MD, ) (AGE -> ISOVF, ) (AGE -> ICVF, ) (AGE -> OD, ) (AGE -> PROT, ) (AGE -> PD, ) (PROT <- _cons@0, ) (PROT -> FA, ) (PROT -> MD, ) (PROT -> ISOVF, ) (PROT -> ICVF, ) (PROT -> OD, ) (PROT@1 -> M1, ) (PROT -> M2, ) (SEX -> FA, ) (SEX -> MD, ) (SEX -> ISOVF, ) (SEX -> ICVF, ) (SEX -> OD, ) (SEX -> PROT, ) (SEX -> PD, ) (PD -> FA, ) (PD -> MD, ) (PD -> ISOVF, ) (PD -> ICVF, ) (PD -> OD, ) (PD -> PROT, ) (SES -> FA, ) (SES -> MD, ) (SES -> ISOVF, ) (SES -> ICVF, ) (SES -> OD, ) (SES -> PROT, ) (SES -> PD, ) (HS -> FA, ) (HS -> MD, ) (HS -> ISOVF, ) (HS -> ICVF, ) (HS -> OD, ) (HS -> PROT, ) (HS -> PD, ) (LE8 -> FA, ) (LE8 -> MD, ) (LE8 -> ISOVF, ) (LE8 -> ICVF, ) (LE8 -> OD, ) (LE8 -> PROT, ) (LE8 -> PD, ) if sample_final==1, latent(PROT ) cov(e.FA*e.MD e.FA*e.ICVF e.FA*e.ISOVF e.FA*e.OD e.MD*e.ICVF e.MD*e.ISOVF e.MD*e.OD e.ICVF*e.ISOVF e.ICVF*e.OD e.ISOVF*e.OD e.PROT@1 e.M1@1) nocapslatent
{res}{txt}(429 observations with missing values excluded)

Endogenous variables
{p 2 15 2}Observed:{space 4}{res}FA MD ISOVF ICVF OD PD{p_end}
{txt}{p 2 15 2}Measurement:{space 1}{res}M1 M2{p_end}
{txt}{p 2 15 2}Latent:{space 6}{res}PROT{p_end}
{txt}
Exogenous variables
{p 2 12 2}Observed:{space 1}{res}QUARTER0 FASTING TIME_V0V2 AGE SEX SES HS LE8{p_end}
{txt}
Fitting target model:
Iteration 0:{space 2}Log likelihood = {res:-162964.36}  (not concave)
Iteration 1:{space 2}Log likelihood = {res:-154876.19}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-154133.83}  (not concave)
Iteration 3:{space 2}Log likelihood = {res:-152120.58}  (not concave)
Iteration 4:{space 2}Log likelihood = {res:-151377.63}  (not concave)
Iteration 5:{space 2}Log likelihood = {res:-150179.78}  (not concave)
Iteration 6:{space 2}Log likelihood = {res:-147866.17}  (not concave)
Iteration 7:{space 2}Log likelihood = {res:-147286.49}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-146886.29}  (not concave)
Iteration 9:{space 2}Log likelihood = {res: -146644.9}  (not concave)
Iteration 10:{space 1}Log likelihood = {res:-146449.28}  (not concave)
Iteration 11:{space 1}Log likelihood = {res:-146376.11}  (not concave)
Iteration 12:{space 1}Log likelihood = {res:-146328.28}  (not concave)
Iteration 13:{space 1}Log likelihood = {res:   -146299}  (not concave)
Iteration 14:{space 1}Log likelihood = {res:-146272.48}  
Iteration 15:{space 1}Log likelihood = {res:-146133.35}  (not concave)
Iteration 16:{space 1}Log likelihood = {res:-145953.34}  (not concave)
Iteration 17:{space 1}Log likelihood = {res:-145890.78}  (not concave)
Iteration 18:{space 1}Log likelihood = {res:-145870.79}  (not concave)
Iteration 19:{space 1}Log likelihood = {res:-145857.15}  
Iteration 20:{space 1}Log likelihood = {res: -145743.5}  (not concave)
Iteration 21:{space 1}Log likelihood = {res:-145733.54}  
Iteration 22:{space 1}Log likelihood = {res:-145700.37}  (not concave)
Iteration 23:{space 1}Log likelihood = {res:-145681.81}  (not concave)
Iteration 24:{space 1}Log likelihood = {res:-145672.37}  
Iteration 25:{space 1}Log likelihood = {res:-145662.02}  (not concave)
Iteration 26:{space 1}Log likelihood = {res:-145628.28}  (not concave)
Iteration 27:{space 1}Log likelihood = {res:-145618.79}  (not concave)
Iteration 28:{space 1}Log likelihood = {res:-145613.66}  
Iteration 29:{space 1}Log likelihood = {res:-145534.67}  (not concave)
Iteration 30:{space 1}Log likelihood = {res:-145531.18}  
Iteration 31:{space 1}Log likelihood = {res:-145526.31}  
Iteration 32:{space 1}Log likelihood = {res: -145520.8}  
Iteration 33:{space 1}Log likelihood = {res:-145518.93}  
Iteration 34:{space 1}Log likelihood = {res:-145518.37}  
Iteration 35:{space 1}Log likelihood = {res:-145518.36}  
Iteration 36:{space 1}Log likelihood = {res:-145518.36}  

{col 1}Structural equation model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,660}
{txt}{col 1}Estimation method: {res:ml}

{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-145518.36}

{p 0 7}{space 1}{text:( 1)}{space 1} [M1]PROT = 1{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [/]var(e.M1) = 1{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [/]var(e.PROT) = 1{p_end}
{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}      OIM
{col 20}{c |} Coefficient{col 32}  std. err.{col 44}      z{col 52}   P>|z|{col 60}     [95% con{col 73}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural        {col 20}{txt}{c |}
{space 2}{col 3}FA              {col 20}{c |}
{space 16}PD {c |}{col 20}{res}{space 2}-.1145801{col 32}{space 2} .0447093{col 43}{space 1}   -2.56{col 52}{space 3}0.010{col 60}{space 4}-.2022087{col 73}{space 3}-.0269514
{txt}{space 14}PROT {c |}{col 20}{res}{space 2}-.0794393{col 32}{space 2} .0206782{col 43}{space 1}   -3.84{col 52}{space 3}0.000{col 60}{space 4}-.1199679{col 73}{space 3}-.0389107
{txt}{space 10}QUARTER0 {c |}{col 20}{res}{space 2}-.0164814{col 32}{space 2} .0127195{col 43}{space 1}   -1.30{col 52}{space 3}0.195{col 60}{space 4}-.0414112{col 73}{space 3} .0084485
{txt}{space 11}FASTING {c |}{col 20}{res}{space 2}-.0095477{col 32}{space 2} .0057469{col 43}{space 1}   -1.66{col 52}{space 3}0.097{col 60}{space 4}-.0208113{col 73}{space 3}  .001716
{txt}{space 9}TIME_V0V2 {c |}{col 20}{res}{space 2}-.0001483{col 32}{space 2} .0000214{col 43}{space 1}   -6.93{col 52}{space 3}0.000{col 60}{space 4}-.0001903{col 73}{space 3}-.0001063
{txt}{space 15}AGE {c |}{col 20}{res}{space 2}-.0404677{col 32}{space 2} .0022433{col 43}{space 1}  -18.04{col 52}{space 3}0.000{col 60}{space 4}-.0448646{col 73}{space 3}-.0360709
{txt}{space 15}SEX {c |}{col 20}{res}{space 2}-.0918916{col 32}{space 2} .0278272{col 43}{space 1}   -3.30{col 52}{space 3}0.001{col 60}{space 4}-.1464319{col 73}{space 3}-.0373513
{txt}{space 15}SES {c |}{col 20}{res}{space 2} .0487643{col 32}{space 2} .0214219{col 43}{space 1}    2.28{col 52}{space 3}0.023{col 60}{space 4} .0067781{col 73}{space 3} .0907504
{txt}{space 16}HS {c |}{col 20}{res}{space 2} .0201049{col 32}{space 2} .0126074{col 43}{space 1}    1.59{col 52}{space 3}0.111{col 60}{space 4}-.0046051{col 73}{space 3} .0448149
{txt}{space 15}LE8 {c |}{col 20}{res}{space 2} .0006366{col 32}{space 2} .0001524{col 43}{space 1}    4.18{col 52}{space 3}0.000{col 60}{space 4} .0003379{col 73}{space 3} .0009352
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 2.682154{col 32}{space 2} .1764991{col 43}{space 1}   15.20{col 52}{space 3}0.000{col 60}{space 4} 2.336222{col 73}{space 3} 3.028086
{space 2}{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}MD              {col 20}{c |}
{space 16}PD {c |}{col 20}{res}{space 2} .0899424{col 32}{space 2} .0435163{col 43}{space 1}    2.07{col 52}{space 3}0.039{col 60}{space 4} .0046519{col 73}{space 3} .1752328
{txt}{space 14}PROT {c |}{col 20}{res}{space 2}  .076773{col 32}{space 2} .0201589{col 43}{space 1}    3.81{col 52}{space 3}0.000{col 60}{space 4} .0372622{col 73}{space 3} .1162838
{txt}{space 10}QUARTER0 {c |}{col 20}{res}{space 2} .0097451{col 32}{space 2} .0123798{col 43}{space 1}    0.79{col 52}{space 3}0.431{col 60}{space 4} -.014519{col 73}{space 3} .0340091
{txt}{space 11}FASTING {c |}{col 20}{res}{space 2} .0016671{col 32}{space 2} .0055934{col 43}{space 1}    0.30{col 52}{space 3}0.766{col 60}{space 4}-.0092958{col 73}{space 3} .0126299
{txt}{space 9}TIME_V0V2 {c |}{col 20}{res}{space 2} .0000717{col 32}{space 2} .0000208{col 43}{space 1}    3.44{col 52}{space 3}0.001{col 60}{space 4} .0000309{col 73}{space 3} .0001126
{txt}{space 15}AGE {c |}{col 20}{res}{space 2} .0518873{col 32}{space 2} .0021846{col 43}{space 1}   23.75{col 52}{space 3}0.000{col 60}{space 4} .0476055{col 73}{space 3} .0561691
{txt}{space 15}SEX {c |}{col 20}{res}{space 2}-.0808602{col 32}{space 2} .0270847{col 43}{space 1}   -2.99{col 52}{space 3}0.003{col 60}{space 4}-.1339452{col 73}{space 3}-.0277752
{txt}{space 15}SES {c |}{col 20}{res}{space 2}   .02279{col 32}{space 2} .0208501{col 43}{space 1}    1.09{col 52}{space 3}0.274{col 60}{space 4}-.0180754{col 73}{space 3} .0636555
{txt}{space 16}HS {c |}{col 20}{res}{space 2}-.0197842{col 32}{space 2} .0122707{col 43}{space 1}   -1.61{col 52}{space 3}0.107{col 60}{space 4}-.0438342{col 73}{space 3} .0042659
{txt}{space 15}LE8 {c |}{col 20}{res}{space 2} .0000478{col 32}{space 2} .0001483{col 43}{space 1}    0.32{col 52}{space 3}0.747{col 60}{space 4}-.0002429{col 73}{space 3} .0003385
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-3.098859{col 32}{space 2} .1717788{col 43}{space 1}  -18.04{col 52}{space 3}0.000{col 60}{space 4}-3.435539{col 73}{space 3}-2.762179
{space 2}{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ISOVF           {col 20}{c |}
{space 16}PD {c |}{col 20}{res}{space 2} .0879131{col 32}{space 2} .0435841{col 43}{space 1}    2.02{col 52}{space 3}0.044{col 60}{space 4} .0024898{col 73}{space 3} .1733364
{txt}{space 14}PROT {c |}{col 20}{res}{space 2} .0918878{col 32}{space 2} .0201085{col 43}{space 1}    4.57{col 52}{space 3}0.000{col 60}{space 4} .0524758{col 73}{space 3} .1312998
{txt}{space 10}QUARTER0 {c |}{col 20}{res}{space 2}-.0041829{col 32}{space 2} .0123999{col 43}{space 1}   -0.34{col 52}{space 3}0.736{col 60}{space 4}-.0284862{col 73}{space 3} .0201204
{txt}{space 11}FASTING {c |}{col 20}{res}{space 2}-.0037074{col 32}{space 2} .0056024{col 43}{space 1}   -0.66{col 52}{space 3}0.508{col 60}{space 4}-.0146879{col 73}{space 3} .0072732
{txt}{space 9}TIME_V0V2 {c |}{col 20}{res}{space 2} .0001546{col 32}{space 2} .0000209{col 43}{space 1}    7.41{col 52}{space 3}0.000{col 60}{space 4} .0001137{col 73}{space 3} .0001955
{txt}{space 15}AGE {c |}{col 20}{res}{space 2} .0491034{col 32}{space 2} .0021851{col 43}{space 1}   22.47{col 52}{space 3}0.000{col 60}{space 4} .0448207{col 73}{space 3} .0533862
{txt}{space 15}SEX {c |}{col 20}{res}{space 2}-.0690554{col 32}{space 2} .0271269{col 43}{space 1}   -2.55{col 52}{space 3}0.011{col 60}{space 4}-.1222231{col 73}{space 3}-.0158877
{txt}{space 15}SES {c |}{col 20}{res}{space 2} .0398412{col 32}{space 2} .0208832{col 43}{space 1}    1.91{col 52}{space 3}0.056{col 60}{space 4}-.0010891{col 73}{space 3} .0807715
{txt}{space 16}HS {c |}{col 20}{res}{space 2}-.0204716{col 32}{space 2} .0122906{col 43}{space 1}   -1.67{col 52}{space 3}0.096{col 60}{space 4}-.0445607{col 73}{space 3} .0036175
{txt}{space 15}LE8 {c |}{col 20}{res}{space 2}-.0002163{col 32}{space 2} .0001485{col 43}{space 1}   -1.46{col 52}{space 3}0.145{col 60}{space 4}-.0005074{col 73}{space 3} .0000749
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-3.066859{col 32}{space 2}  .172253{col 43}{space 1}  -17.80{col 52}{space 3}0.000{col 60}{space 4}-3.404468{col 73}{space 3}-2.729249
{space 2}{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ICVF            {col 20}{c |}
{space 16}PD {c |}{col 20}{res}{space 2}-.0672532{col 32}{space 2}  .045899{col 43}{space 1}   -1.47{col 52}{space 3}0.143{col 60}{space 4}-.1572135{col 73}{space 3} .0227071
{txt}{space 14}PROT {c |}{col 20}{res}{space 2}-.0405765{col 32}{space 2} .0212604{col 43}{space 1}   -1.91{col 52}{space 3}0.056{col 60}{space 4}-.0822461{col 73}{space 3} .0010931
{txt}{space 10}QUARTER0 {c |}{col 20}{res}{space 2}-.0161842{col 32}{space 2}  .013058{col 43}{space 1}   -1.24{col 52}{space 3}0.215{col 60}{space 4}-.0417774{col 73}{space 3}  .009409
{txt}{space 11}FASTING {c |}{col 20}{res}{space 2}-.0069948{col 32}{space 2} .0058998{col 43}{space 1}   -1.19{col 52}{space 3}0.236{col 60}{space 4}-.0185581{col 73}{space 3} .0045685
{txt}{space 9}TIME_V0V2 {c |}{col 20}{res}{space 2} 4.29e-06{col 32}{space 2}  .000022{col 43}{space 1}    0.20{col 52}{space 3}0.845{col 60}{space 4}-.0000388{col 73}{space 3} .0000474
{txt}{space 15}AGE {c |}{col 20}{res}{space 2}-.0342826{col 32}{space 2} .0023031{col 43}{space 1}  -14.89{col 52}{space 3}0.000{col 60}{space 4}-.0387967{col 73}{space 3}-.0297686
{txt}{space 15}SEX {c |}{col 20}{res}{space 2}-.0306639{col 32}{space 2} .0285677{col 43}{space 1}   -1.07{col 52}{space 3}0.283{col 60}{space 4}-.0866556{col 73}{space 3} .0253278
{txt}{space 15}SES {c |}{col 20}{res}{space 2} -.000755{col 32}{space 2} .0219914{col 43}{space 1}   -0.03{col 52}{space 3}0.973{col 60}{space 4}-.0438574{col 73}{space 3} .0423474
{txt}{space 16}HS {c |}{col 20}{res}{space 2} .0204477{col 32}{space 2}  .012943{col 43}{space 1}    1.58{col 52}{space 3}0.114{col 60}{space 4}-.0049201{col 73}{space 3} .0458154
{txt}{space 15}LE8 {c |}{col 20}{res}{space 2}-.0001718{col 32}{space 2} .0001564{col 43}{space 1}   -1.10{col 52}{space 3}0.272{col 60}{space 4}-.0004784{col 73}{space 3} .0001348
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 2.090866{col 32}{space 2} .1808273{col 43}{space 1}   11.56{col 52}{space 3}0.000{col 60}{space 4} 1.736451{col 73}{space 3} 2.445281
{space 2}{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}OD              {col 20}{c |}
{space 16}PD {c |}{col 20}{res}{space 2} .0507065{col 32}{space 2} .0476378{col 43}{space 1}    1.06{col 52}{space 3}0.287{col 60}{space 4}-.0426619{col 73}{space 3} .1440749
{txt}{space 14}PROT {c |}{col 20}{res}{space 2} .0766155{col 32}{space 2} .0219503{col 43}{space 1}    3.49{col 52}{space 3}0.000{col 60}{space 4} .0335937{col 73}{space 3} .1196374
{txt}{space 10}QUARTER0 {c |}{col 20}{res}{space 2} .0113101{col 32}{space 2} .0135538{col 43}{space 1}    0.83{col 52}{space 3}0.404{col 60}{space 4}-.0152548{col 73}{space 3}  .037875
{txt}{space 11}FASTING {c |}{col 20}{res}{space 2} .0111096{col 32}{space 2} .0061237{col 43}{space 1}    1.81{col 52}{space 3}0.070{col 60}{space 4}-.0008927{col 73}{space 3} .0231119
{txt}{space 9}TIME_V0V2 {c |}{col 20}{res}{space 2} .0002323{col 32}{space 2} .0000228{col 43}{space 1}   10.18{col 52}{space 3}0.000{col 60}{space 4} .0001875{col 73}{space 3}  .000277
{txt}{space 15}AGE {c |}{col 20}{res}{space 2} .0178564{col 32}{space 2} .0023863{col 43}{space 1}    7.48{col 52}{space 3}0.000{col 60}{space 4} .0131794{col 73}{space 3} .0225335
{txt}{space 15}SEX {c |}{col 20}{res}{space 2} .0438632{col 32}{space 2}   .02965{col 43}{space 1}    1.48{col 52}{space 3}0.139{col 60}{space 4}-.0142498{col 73}{space 3} .1019761
{txt}{space 15}SES {c |}{col 20}{res}{space 2}-.0584289{col 32}{space 2} .0228255{col 43}{space 1}   -2.56{col 52}{space 3}0.010{col 60}{space 4} -.103166{col 73}{space 3}-.0136918
{txt}{space 16}HS {c |}{col 20}{res}{space 2} -.000101{col 32}{space 2} .0134344{col 43}{space 1}   -0.01{col 52}{space 3}0.994{col 60}{space 4} -.026432{col 73}{space 3}   .02623
{txt}{space 15}LE8 {c |}{col 20}{res}{space 2}-.0008493{col 32}{space 2} .0001624{col 43}{space 1}   -5.23{col 52}{space 3}0.000{col 60}{space 4}-.0011676{col 73}{space 3}-.0005311
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-1.568223{col 32}{space 2} .1879834{col 43}{space 1}   -8.34{col 52}{space 3}0.000{col 60}{space 4}-1.936664{col 73}{space 3}-1.199783
{space 2}{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PD              {col 20}{c |}
{space 10}QUARTER0 {c |}{col 20}{res}{space 2} .0031886{col 32}{space 2} .0041904{col 43}{space 1}    0.76{col 52}{space 3}0.447{col 60}{space 4}-.0050245{col 73}{space 3} .0114016
{txt}{space 11}FASTING {c |}{col 20}{res}{space 2} .0009616{col 32}{space 2} .0018929{col 43}{space 1}    0.51{col 52}{space 3}0.611{col 60}{space 4}-.0027485{col 73}{space 3} .0046717
{txt}{space 9}TIME_V0V2 {c |}{col 20}{res}{space 2} 1.01e-06{col 32}{space 2} 7.05e-06{col 43}{space 1}    0.14{col 52}{space 3}0.886{col 60}{space 4}-.0000128{col 73}{space 3} .0000148
{txt}{space 15}AGE {c |}{col 20}{res}{space 2} .0080502{col 32}{space 2} .0006254{col 43}{space 1}   12.87{col 52}{space 3}0.000{col 60}{space 4} .0068244{col 73}{space 3}  .009276
{txt}{space 15}SEX {c |}{col 20}{res}{space 2}-.0123228{col 32}{space 2} .0091157{col 43}{space 1}   -1.35{col 52}{space 3}0.176{col 60}{space 4}-.0301892{col 73}{space 3} .0055437
{txt}{space 15}SES {c |}{col 20}{res}{space 2}-.0392318{col 32}{space 2} .0070168{col 43}{space 1}   -5.59{col 52}{space 3}0.000{col 60}{space 4}-.0529845{col 73}{space 3} -.025479
{txt}{space 16}HS {c |}{col 20}{res}{space 2} .0061473{col 32}{space 2} .0041454{col 43}{space 1}    1.48{col 52}{space 3}0.138{col 60}{space 4}-.0019775{col 73}{space 3} .0142721
{txt}{space 15}LE8 {c |}{col 20}{res}{space 2}-.0002362{col 32}{space 2} .0000492{col 43}{space 1}   -4.80{col 52}{space 3}0.000{col 60}{space 4}-.0003326{col 73}{space 3}-.0001399
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} -.216558{col 32}{space 2} .0579083{col 43}{space 1}   -3.74{col 52}{space 3}0.000{col 60}{space 4}-.3300563{col 73}{space 3}-.1030598
{space 2}{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PROT            {col 20}{c |}
{space 16}PD {c |}{col 20}{res}{space 2}  .226579{col 32}{space 2} .0547534{col 43}{space 1}    4.14{col 52}{space 3}0.000{col 60}{space 4} .1192644{col 73}{space 3} .3338937
{txt}{space 10}QUARTER0 {c |}{col 20}{res}{space 2} -.004945{col 32}{space 2} .0156407{col 43}{space 1}   -0.32{col 52}{space 3}0.752{col 60}{space 4}-.0356003{col 73}{space 3} .0257103
{txt}{space 11}FASTING {c |}{col 20}{res}{space 2} .0060769{col 32}{space 2} .0070682{col 43}{space 1}    0.86{col 52}{space 3}0.390{col 60}{space 4}-.0077766{col 73}{space 3} .0199303
{txt}{space 9}TIME_V0V2 {c |}{col 20}{res}{space 2}-.0000259{col 32}{space 2} .0000263{col 43}{space 1}   -0.98{col 52}{space 3}0.325{col 60}{space 4}-.0000775{col 73}{space 3} .0000257
{txt}{space 15}AGE {c |}{col 20}{res}{space 2} .0549909{col 32}{space 2} .0024647{col 43}{space 1}   22.31{col 52}{space 3}0.000{col 60}{space 4} .0501602{col 73}{space 3} .0598216
{txt}{space 15}SEX {c |}{col 20}{res}{space 2}-.1411976{col 32}{space 2} .0340719{col 43}{space 1}   -4.14{col 52}{space 3}0.000{col 60}{space 4}-.2079774{col 73}{space 3}-.0744178
{txt}{space 15}SES {c |}{col 20}{res}{space 2}-.0724573{col 32}{space 2} .0263424{col 43}{space 1}   -2.75{col 52}{space 3}0.006{col 60}{space 4}-.1240874{col 73}{space 3}-.0208271
{txt}{space 16}HS {c |}{col 20}{res}{space 2}-.0367265{col 32}{space 2}  .015498{col 43}{space 1}   -2.37{col 52}{space 3}0.018{col 60}{space 4} -.067102{col 73}{space 3}-.0063511
{txt}{space 15}LE8 {c |}{col 20}{res}{space 2}-.0014058{col 32}{space 2} .0001843{col 43}{space 1}   -7.63{col 52}{space 3}0.000{col 60}{space 4}-.0017671{col 73}{space 3}-.0010445
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Measurement       {col 20}{txt}{c |}
{space 2}{col 3}M1              {col 20}{c |}
{space 14}PROT {c |}{col 20}{res}{space 2}        1{col 32}{txt}  (constrained)
{space 13}_cons {c |}{col 20}{res}{space 2}-1.889969{col 32}{space 2} .2193784{col 43}{space 1}   -8.62{col 52}{space 3}0.000{col 60}{space 4}-2.319943{col 73}{space 3}-1.459995
{space 2}{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}M2              {col 20}{c |}
{space 14}PROT {c |}{col 20}{res}{space 2}  .880797{col 32}{space 2} .0196626{col 43}{space 1}   44.80{col 52}{space 3}0.000{col 60}{space 4} .8422591{col 73}{space 3} .9193349
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-1.661903{col 32}{space 2} .1908436{col 43}{space 1}   -8.71{col 52}{space 3}0.000{col 60}{space 4} -2.03595{col 73}{space 3}-1.287856
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}var(e.FA){c |}{col 20}{res}{space 2} .8411339{col 32}{space 2} .0174691{col 60}{space 4} .8075825{col 73}{space 3} .8760791
{txt}{space 10}var(e.MD){c |}{col 20}{res}{space 2} .7968277{col 32}{space 2} .0165488{col 60}{space 4}  .765044{col 73}{space 3}  .829932
{txt}{space 7}var(e.ISOVF){c |}{col 20}{res}{space 2} .7987164{col 32}{space 2} .0166042{col 60}{space 4}  .766827{col 73}{space 3} .8319321
{txt}{space 8}var(e.ICVF){c |}{col 20}{res}{space 2}   .88787{col 32}{space 2} .0184052{col 60}{space 4} .8525193{col 73}{space 3} .9246864
{txt}{space 10}var(e.OD){c |}{col 20}{res}{space 2} .9554441{col 32}{space 2} .0198331{col 60}{space 4}  .917352{col 73}{space 3} .9951179
{txt}{space 10}var(e.PD){c |}{col 20}{res}{space 2} .0914976{col 32}{space 2} .0018955{col 60}{space 4} .0878568{col 73}{space 3} .0952892
{txt}{space 10}var(e.M1){c |}{col 20}{res}{space 2}        1{col 32}{txt}  (constrained)
{space 10}var(e.M2){c |}{col 20}{res}{space 2} .2933345{col 32}{space 2} .0220133{col 60}{space 4} .2532122{col 73}{space 3} .3398143
{txt}{space 8}var(e.PROT){c |}{col 20}{res}{space 2}        1{col 32}{txt}  (constrained)
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}cov(e.FA,e.MD){c |}{col 20}{res}{space 2}-.6423951{col 32}{space 2} .0152863{col 43}{space 1}  -42.02{col 52}{space 3}0.000{col 60}{space 4}-.6723558{col 73}{space 3}-.6124345
{txt}{space 2}cov(e.FA,e.ISOVF){c |}{col 20}{res}{space 2}-.3505099{col 32}{space 2} .0131061{col 43}{space 1}  -26.74{col 52}{space 3}0.000{col 60}{space 4}-.3761973{col 73}{space 3}-.3248225
{txt}{space 3}cov(e.FA,e.ICVF){c |}{col 20}{res}{space 2} .6377285{col 32}{space 2} .0157587{col 43}{space 1}   40.47{col 52}{space 3}0.000{col 60}{space 4} .6068421{col 73}{space 3}  .668615
{txt}{space 5}cov(e.FA,e.OD){c |}{col 20}{res}{space 2}-.4573362{col 32}{space 2} .0147819{col 43}{space 1}  -30.94{col 52}{space 3}0.000{col 60}{space 4}-.4863081{col 73}{space 3}-.4283642
{txt}{space 2}cov(e.MD,e.ISOVF){c |}{col 20}{res}{space 2} .5501866{col 32}{space 2} .0142446{col 43}{space 1}   38.62{col 52}{space 3}0.000{col 60}{space 4} .5222676{col 73}{space 3} .5781055
{txt}{space 3}cov(e.MD,e.ICVF){c |}{col 20}{res}{space 2}-.6466608{col 32}{space 2} .0155667{col 43}{space 1}  -41.54{col 52}{space 3}0.000{col 60}{space 4} -.677171{col 73}{space 3}-.6161507
{txt}{space 5}cov(e.MD,e.OD){c |}{col 20}{res}{space 2} .1225067{col 32}{space 2} .0129394{col 43}{space 1}    9.47{col 52}{space 3}0.000{col 60}{space 4}  .097146{col 73}{space 3} .1478674
{txt}cov(e.ISOVF,e.ICVF){c |}{col 20}{res}{space 2}-.1055913{col 32}{space 2} .0124607{col 43}{space 1}   -8.47{col 52}{space 3}0.000{col 60}{space 4}-.1300138{col 73}{space 3}-.0811688
{txt}{space 2}cov(e.ISOVF,e.OD){c |}{col 20}{res}{space 2}  .221199{col 32}{space 2} .0132428{col 43}{space 1}   16.70{col 52}{space 3}0.000{col 60}{space 4} .1952435{col 73}{space 3} .2471544
{txt}{space 3}cov(e.ICVF,e.OD){c |}{col 20}{res}{space 2} .0441155{col 32}{space 2}  .013525{col 43}{space 1}    3.26{col 52}{space 3}0.001{col 60}{space 4}  .017607{col 73}{space 3} .0706239
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of model vs. saturated: chi2({res:15}) = {ralign 7:{res:{ralign 7:1581.09}}}{col 65}Prob > chi2 = {res}{ralign 6:{ralign 6:0.0000}}
{txt}
{com}. 
. estat teffects
{res}

{txt}Direct effects
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}      OIM
{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural  {col 14}{txt}{c |}
{space 2}{col 3}MD        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .0899424{col 26}{space 2} .0435163{col 37}{space 1}    2.07{col 46}{space 3}0.039{col 54}{space 4} .0046519{col 67}{space 3} .1752328
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}  .076773{col 26}{space 2} .0201589{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0372622{col 67}{space 3} .1162838
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2} .0097451{col 26}{space 2} .0123798{col 37}{space 1}    0.79{col 46}{space 3}0.431{col 54}{space 4} -.014519{col 67}{space 3} .0340091
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0016671{col 26}{space 2} .0055934{col 37}{space 1}    0.30{col 46}{space 3}0.766{col 54}{space 4}-.0092958{col 67}{space 3} .0126299
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} .0000717{col 26}{space 2} .0000208{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0000309{col 67}{space 3} .0001126
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0518873{col 26}{space 2} .0021846{col 37}{space 1}   23.75{col 46}{space 3}0.000{col 54}{space 4} .0476055{col 67}{space 3} .0561691
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0808602{col 26}{space 2} .0270847{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.1339452{col 67}{space 3}-.0277752
{txt}{space 9}SES {c |}{col 14}{res}{space 2}   .02279{col 26}{space 2} .0208501{col 37}{space 1}    1.09{col 46}{space 3}0.274{col 54}{space 4}-.0180754{col 67}{space 3} .0636555
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0197842{col 26}{space 2} .0122707{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-.0438342{col 67}{space 3} .0042659
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2} .0000478{col 26}{space 2} .0001483{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-.0002429{col 67}{space 3} .0003385
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ISOVF     {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .0879131{col 26}{space 2} .0435841{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 54}{space 4} .0024898{col 67}{space 3} .1733364
{txt}{space 8}PROT {c |}{col 14}{res}{space 2} .0918878{col 26}{space 2} .0201085{col 37}{space 1}    4.57{col 46}{space 3}0.000{col 54}{space 4} .0524758{col 67}{space 3} .1312998
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0041829{col 26}{space 2} .0123999{col 37}{space 1}   -0.34{col 46}{space 3}0.736{col 54}{space 4}-.0284862{col 67}{space 3} .0201204
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0037074{col 26}{space 2} .0056024{col 37}{space 1}   -0.66{col 46}{space 3}0.508{col 54}{space 4}-.0146879{col 67}{space 3} .0072732
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} .0001546{col 26}{space 2} .0000209{col 37}{space 1}    7.41{col 46}{space 3}0.000{col 54}{space 4} .0001137{col 67}{space 3} .0001955
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0491034{col 26}{space 2} .0021851{col 37}{space 1}   22.47{col 46}{space 3}0.000{col 54}{space 4} .0448207{col 67}{space 3} .0533862
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0690554{col 26}{space 2} .0271269{col 37}{space 1}   -2.55{col 46}{space 3}0.011{col 54}{space 4}-.1222231{col 67}{space 3}-.0158877
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0398412{col 26}{space 2} .0208832{col 37}{space 1}    1.91{col 46}{space 3}0.056{col 54}{space 4}-.0010891{col 67}{space 3} .0807715
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0204716{col 26}{space 2} .0122906{col 37}{space 1}   -1.67{col 46}{space 3}0.096{col 54}{space 4}-.0445607{col 67}{space 3} .0036175
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0002163{col 26}{space 2} .0001485{col 37}{space 1}   -1.46{col 46}{space 3}0.145{col 54}{space 4}-.0005074{col 67}{space 3} .0000749
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ICVF      {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}-.0672532{col 26}{space 2}  .045899{col 37}{space 1}   -1.47{col 46}{space 3}0.143{col 54}{space 4}-.1572135{col 67}{space 3} .0227071
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}-.0405765{col 26}{space 2} .0212604{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-.0822461{col 67}{space 3} .0010931
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0161842{col 26}{space 2}  .013058{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0417774{col 67}{space 3}  .009409
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0069948{col 26}{space 2} .0058998{col 37}{space 1}   -1.19{col 46}{space 3}0.236{col 54}{space 4}-.0185581{col 67}{space 3} .0045685
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} 4.29e-06{col 26}{space 2}  .000022{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.0000388{col 67}{space 3} .0000474
{txt}{space 9}AGE {c |}{col 14}{res}{space 2}-.0342826{col 26}{space 2} .0023031{col 37}{space 1}  -14.89{col 46}{space 3}0.000{col 54}{space 4}-.0387967{col 67}{space 3}-.0297686
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0306639{col 26}{space 2} .0285677{col 37}{space 1}   -1.07{col 46}{space 3}0.283{col 54}{space 4}-.0866556{col 67}{space 3} .0253278
{txt}{space 9}SES {c |}{col 14}{res}{space 2} -.000755{col 26}{space 2} .0219914{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-.0438574{col 67}{space 3} .0423474
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0204477{col 26}{space 2}  .012943{col 37}{space 1}    1.58{col 46}{space 3}0.114{col 54}{space 4}-.0049201{col 67}{space 3} .0458154
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0001718{col 26}{space 2} .0001564{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-.0004784{col 67}{space 3} .0001348
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}OD        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .0507065{col 26}{space 2} .0476378{col 37}{space 1}    1.06{col 46}{space 3}0.287{col 54}{space 4}-.0426619{col 67}{space 3} .1440749
{txt}{space 8}PROT {c |}{col 14}{res}{space 2} .0766155{col 26}{space 2} .0219503{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .0335937{col 67}{space 3} .1196374
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2} .0113101{col 26}{space 2} .0135538{col 37}{space 1}    0.83{col 46}{space 3}0.404{col 54}{space 4}-.0152548{col 67}{space 3}  .037875
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0111096{col 26}{space 2} .0061237{col 37}{space 1}    1.81{col 46}{space 3}0.070{col 54}{space 4}-.0008927{col 67}{space 3} .0231119
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} .0002323{col 26}{space 2} .0000228{col 37}{space 1}   10.18{col 46}{space 3}0.000{col 54}{space 4} .0001875{col 67}{space 3}  .000277
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0178564{col 26}{space 2} .0023863{col 37}{space 1}    7.48{col 46}{space 3}0.000{col 54}{space 4} .0131794{col 67}{space 3} .0225335
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .0438632{col 26}{space 2}   .02965{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0142498{col 67}{space 3} .1019761
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0584289{col 26}{space 2} .0228255{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4} -.103166{col 67}{space 3}-.0136918
{txt}{space 10}HS {c |}{col 14}{res}{space 2} -.000101{col 26}{space 2} .0134344{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4} -.026432{col 67}{space 3}   .02623
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0008493{col 26}{space 2} .0001624{col 37}{space 1}   -5.23{col 46}{space 3}0.000{col 54}{space 4}-.0011676{col 67}{space 3}-.0005311
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PD        {col 14}{c |}
{space 4}QUARTER0 {c |}{col 14}{res}{space 2} .0031886{col 26}{space 2} .0041904{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4}-.0050245{col 67}{space 3} .0114016
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0009616{col 26}{space 2} .0018929{col 37}{space 1}    0.51{col 46}{space 3}0.611{col 54}{space 4}-.0027485{col 67}{space 3} .0046717
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} 1.01e-06{col 26}{space 2} 7.05e-06{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-.0000128{col 67}{space 3} .0000148
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0080502{col 26}{space 2} .0006254{col 37}{space 1}   12.87{col 46}{space 3}0.000{col 54}{space 4} .0068244{col 67}{space 3}  .009276
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0123228{col 26}{space 2} .0091157{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-.0301892{col 67}{space 3} .0055437
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0392318{col 26}{space 2} .0070168{col 37}{space 1}   -5.59{col 46}{space 3}0.000{col 54}{space 4}-.0529845{col 67}{space 3} -.025479
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0061473{col 26}{space 2} .0041454{col 37}{space 1}    1.48{col 46}{space 3}0.138{col 54}{space 4}-.0019775{col 67}{space 3} .0142721
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0002362{col 26}{space 2} .0000492{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-.0003326{col 67}{space 3}-.0001399
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PROT      {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}  .226579{col 26}{space 2} .0547534{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .1192644{col 67}{space 3} .3338937
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2} -.004945{col 26}{space 2} .0156407{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-.0356003{col 67}{space 3} .0257103
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0060769{col 26}{space 2} .0070682{col 37}{space 1}    0.86{col 46}{space 3}0.390{col 54}{space 4}-.0077766{col 67}{space 3} .0199303
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0000259{col 26}{space 2} .0000263{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-.0000775{col 67}{space 3} .0000257
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0549909{col 26}{space 2} .0024647{col 37}{space 1}   22.31{col 46}{space 3}0.000{col 54}{space 4} .0501602{col 67}{space 3} .0598216
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.1411976{col 26}{space 2} .0340719{col 37}{space 1}   -4.14{col 46}{space 3}0.000{col 54}{space 4}-.2079774{col 67}{space 3}-.0744178
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0724573{col 26}{space 2} .0263424{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.1240874{col 67}{space 3}-.0208271
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0367265{col 26}{space 2}  .015498{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4} -.067102{col 67}{space 3}-.0063511
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0014058{col 26}{space 2} .0001843{col 37}{space 1}   -7.63{col 46}{space 3}0.000{col 54}{space 4}-.0017671{col 67}{space 3}-.0010445
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Measurement {col 14}{txt}{c |}
{space 2}{col 3}M1        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 8}PROT {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 5}FASTING {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}AGE {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}SEX {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}SES {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 10}HS {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}LE8 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 2}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}M2        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 8}PROT {c |}{col 14}{res}{space 2}  .880797{col 26}{space 2} .0196626{col 37}{space 1}   44.80{col 46}{space 3}0.000{col 54}{space 4} .8422591{col 67}{space 3} .9193349
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 5}FASTING {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}AGE {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}SEX {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}SES {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 10}HS {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}LE8 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural  {col 14}{txt}{c |}
{space 2}{col 3}FA        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}-.1145801{col 26}{space 2} .0447093{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4}-.2022087{col 67}{space 3}-.0269514
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}-.0794393{col 26}{space 2} .0206782{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4}-.1199679{col 67}{space 3}-.0389107
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0164814{col 26}{space 2} .0127195{col 37}{space 1}   -1.30{col 46}{space 3}0.195{col 54}{space 4}-.0414112{col 67}{space 3} .0084485
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0095477{col 26}{space 2} .0057469{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-.0208113{col 67}{space 3}  .001716
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0001483{col 26}{space 2} .0000214{col 37}{space 1}   -6.93{col 46}{space 3}0.000{col 54}{space 4}-.0001903{col 67}{space 3}-.0001063
{txt}{space 9}AGE {c |}{col 14}{res}{space 2}-.0404677{col 26}{space 2} .0022433{col 37}{space 1}  -18.04{col 46}{space 3}0.000{col 54}{space 4}-.0448646{col 67}{space 3}-.0360709
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0918916{col 26}{space 2} .0278272{col 37}{space 1}   -3.30{col 46}{space 3}0.001{col 54}{space 4}-.1464319{col 67}{space 3}-.0373513
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0487643{col 26}{space 2} .0214219{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .0067781{col 67}{space 3} .0907504
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0201049{col 26}{space 2} .0126074{col 37}{space 1}    1.59{col 46}{space 3}0.111{col 54}{space 4}-.0046051{col 67}{space 3} .0448149
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2} .0006366{col 26}{space 2} .0001524{col 37}{space 1}    4.18{col 46}{space 3}0.000{col 54}{space 4} .0003379{col 67}{space 3} .0009352
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}


Indirect effects
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}      OIM
{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural  {col 14}{txt}{c |}
{space 2}{col 3}MD        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .0173952{col 26}{space 2} .0062185{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4}  .005207{col 67}{space 3} .0295833
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0000374{col 26}{space 2} .0012936{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-.0025727{col 67}{space 3} .0024979
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0005698{col 26}{space 2}  .000594{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-.0005945{col 67}{space 3}  .001734
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-1.88e-06{col 26}{space 2} 2.22e-06{col 37}{space 1}   -0.85{col 46}{space 3}0.397{col 54}{space 4}-6.23e-06{col 67}{space 3} 2.47e-06
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0050859{col 26}{space 2} .0011814{col 37}{space 1}    4.30{col 46}{space 3}0.000{col 54}{space 4} .0027704{col 67}{space 3} .0074014
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0121629{col 26}{space 2} .0040286{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.0200587{col 67}{space 3} -.004267
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0097738{col 26}{space 2}  .003112{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0158731{col 67}{space 3}-.0036745
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0021598{col 26}{space 2} .0014905{col 37}{space 1}   -1.45{col 46}{space 3}0.147{col 54}{space 4}-.0050811{col 67}{space 3} .0007615
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0001333{col 26}{space 2} .0000336{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0001992{col 67}{space 3}-.0000673
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ISOVF     {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .0208198{col 26}{space 2} .0067914{col 37}{space 1}    3.07{col 46}{space 3}0.002{col 54}{space 4}  .007509{col 67}{space 3} .0341306
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0001077{col 26}{space 2} .0015172{col 37}{space 1}   -0.07{col 46}{space 3}0.943{col 54}{space 4}-.0030814{col 67}{space 3}  .002866
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}  .000663{col 26}{space 2} .0006936{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.0006964{col 67}{space 3} .0020223
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-2.27e-06{col 26}{space 2} 2.59e-06{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-7.35e-06{col 67}{space 3} 2.80e-06
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0059283{col 26}{space 2} .0011835{col 37}{space 1}    5.01{col 46}{space 3}0.000{col 54}{space 4} .0036086{col 67}{space 3}  .008248
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0143142{col 26}{space 2} .0043752{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.0228896{col 67}{space 3}-.0057389
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0109237{col 26}{space 2} .0033817{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0175518{col 67}{space 3}-.0042957
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0027063{col 26}{space 2} .0016852{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-.0060092{col 67}{space 3} .0005966
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0001549{col 26}{space 2} .0000349{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0002232{col 67}{space 3}-.0000865
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ICVF      {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}-.0091938{col 26}{space 2} .0053128{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-.0196068{col 67}{space 3} .0012192
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0000431{col 26}{space 2} .0007333{col 37}{space 1}   -0.06{col 46}{space 3}0.953{col 54}{space 4}-.0014804{col 67}{space 3} .0013942
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0003201{col 26}{space 2} .0003493{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-.0010048{col 67}{space 3} .0003646
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} 9.75e-07{col 26}{space 2} 1.32e-06{col 37}{space 1}    0.74{col 46}{space 3}0.459{col 54}{space 4}-1.61e-06{col 67}{space 3} 3.56e-06
{txt}{space 9}AGE {c |}{col 14}{res}{space 2}-.0028468{col 26}{space 2}  .001232{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.0052615{col 67}{space 3} -.000432
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .0066713{col 26}{space 2} .0034283{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4} -.000048{col 67}{space 3} .0133907
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0059392{col 26}{space 2} .0026504{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .0007445{col 67}{space 3} .0111339
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0010203{col 26}{space 2} .0010856{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-.0011075{col 67}{space 3} .0031481
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2} .0000751{col 26}{space 2} .0000328{col 37}{space 1}    2.29{col 46}{space 3}0.022{col 54}{space 4} .0000107{col 67}{space 3} .0001395
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}OD        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .0173595{col 26}{space 2} .0065034{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 54}{space 4} .0046131{col 67}{space 3} .0301058
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0001618{col 26}{space 2} .0012457{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-.0026033{col 67}{space 3} .0022797
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}  .000531{col 26}{space 2} .0005742{col 37}{space 1}    0.92{col 46}{space 3}0.355{col 54}{space 4}-.0005943{col 67}{space 3} .0016564
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-1.92e-06{col 26}{space 2} 2.15e-06{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 54}{space 4}-6.13e-06{col 67}{space 3} 2.30e-06
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0047611{col 26}{space 2} .0012793{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .0022538{col 67}{space 3} .0072684
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0116567{col 26}{space 2} .0041386{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.0197683{col 67}{space 3}-.0035451
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0082217{col 26}{space 2} .0032022{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4}-.0144978{col 67}{space 3}-.0019456
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0023954{col 26}{space 2}  .001491{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-.0053177{col 67}{space 3} .0005269
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0001238{col 26}{space 2} .0000359{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.0001941{col 67}{space 3}-.0000535
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PD        {col 14}{c |}
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 5}FASTING {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}AGE {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}SEX {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}SES {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 10}HS {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 9}LE8 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 2}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PROT      {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2} .0007225{col 26}{space 2} .0009654{col 37}{space 1}    0.75{col 46}{space 3}0.454{col 54}{space 4}-.0011696{col 67}{space 3} .0026146
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0002179{col 26}{space 2} .0004321{col 37}{space 1}    0.50{col 46}{space 3}0.614{col 54}{space 4}-.0006291{col 67}{space 3} .0010648
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} 2.30e-07{col 26}{space 2} 1.60e-06{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-2.90e-06{col 67}{space 3} 3.36e-06
{txt}{space 9}AGE {c |}{col 14}{res}{space 2}  .001824{col 26}{space 2}  .000463{col 37}{space 1}    3.94{col 46}{space 3}0.000{col 54}{space 4} .0009166{col 67}{space 3} .0027315
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0027921{col 26}{space 2} .0021728{col 37}{space 1}   -1.28{col 46}{space 3}0.199{col 54}{space 4}-.0070508{col 67}{space 3} .0014666
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0088891{col 26}{space 2} .0026724{col 37}{space 1}   -3.33{col 46}{space 3}0.001{col 54}{space 4} -.014127{col 67}{space 3}-.0036512
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0013929{col 26}{space 2} .0009977{col 37}{space 1}    1.40{col 46}{space 3}0.163{col 54}{space 4}-.0005627{col 67}{space 3} .0033484
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0000535{col 26}{space 2} .0000171{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4} -.000087{col 67}{space 3}-.0000201
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Measurement {col 14}{txt}{c |}
{space 2}{col 3}M1        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}  .226579{col 26}{space 2} .0547534{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .1192644{col 67}{space 3} .3338937
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0042225{col 26}{space 2} .0156685{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.0349322{col 67}{space 3} .0264871
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0062948{col 26}{space 2} .0070811{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4} -.007584{col 67}{space 3} .0201735
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0000257{col 26}{space 2} .0000264{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-.0000774{col 67}{space 3}  .000026
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0568149{col 26}{space 2} .0024359{col 37}{space 1}   23.32{col 46}{space 3}0.000{col 54}{space 4} .0520406{col 67}{space 3} .0615891
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.1439897{col 26}{space 2} .0341298{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.2108828{col 67}{space 3}-.0770965
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0813463{col 26}{space 2} .0263113{col 37}{space 1}   -3.09{col 46}{space 3}0.002{col 54}{space 4}-.1329156{col 67}{space 3}-.0297771
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0353337{col 26}{space 2} .0155233{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.0657588{col 67}{space 3}-.0049086
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0014593{col 26}{space 2} .0001843{col 37}{space 1}   -7.92{col 46}{space 3}0.000{col 54}{space 4}-.0018205{col 67}{space 3}-.0010982
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}M2        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .1995701{col 26}{space 2} .0481889{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .1051216{col 67}{space 3} .2940187
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0037192{col 26}{space 2} .0138001{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.0307668{col 67}{space 3} .0233284
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0055444{col 26}{space 2} .0062345{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4}-.0066749{col 67}{space 3} .0177637
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0000226{col 26}{space 2} .0000232{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-.0000682{col 67}{space 3} .0000229
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0500424{col 26}{space 2} .0021318{col 37}{space 1}   23.47{col 46}{space 3}0.000{col 54}{space 4} .0458642{col 67}{space 3} .0542205
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.1268257{col 26}{space 2} .0300485{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.1857196{col 67}{space 3}-.0679317
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0716496{col 26}{space 2} .0231107{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.1169457{col 67}{space 3}-.0263535
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0311218{col 26}{space 2} .0137146{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4} -.058002{col 67}{space 3}-.0042416
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0012854{col 26}{space 2} .0001642{col 37}{space 1}   -7.83{col 46}{space 3}0.000{col 54}{space 4}-.0016072{col 67}{space 3}-.0009636
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural  {col 14}{txt}{c |}
{space 2}{col 3}FA        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}-.0179993{col 26}{space 2} .0064021{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.0305471{col 67}{space 3}-.0054515
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (no path)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0000299{col 26}{space 2} .0013722{col 37}{space 1}   -0.02{col 46}{space 3}0.983{col 54}{space 4}-.0027195{col 67}{space 3} .0026596
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0006102{col 26}{space 2} .0006295{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.0018439{col 67}{space 3} .0006235
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} 1.93e-06{col 26}{space 2} 2.35e-06{col 37}{space 1}    0.82{col 46}{space 3}0.413{col 54}{space 4}-2.69e-06{col 67}{space 3} 6.54e-06
{txt}{space 9}AGE {c |}{col 14}{res}{space 2}-.0054357{col 26}{space 2} .0012126{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 54}{space 4}-.0078123{col 67}{space 3}-.0030591
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .0128504{col 26}{space 2} .0042008{col 37}{space 1}    3.06{col 46}{space 3}0.002{col 54}{space 4} .0046169{col 67}{space 3} .0210839
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0109573{col 26}{space 2}  .003246{col 37}{space 1}    3.38{col 46}{space 3}0.001{col 54}{space 4} .0045953{col 67}{space 3} .0173193
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0021025{col 26}{space 2} .0015682{col 37}{space 1}    1.34{col 46}{space 3}0.180{col 54}{space 4} -.000971{col 67}{space 3} .0051761
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}  .000143{col 26}{space 2} .0000348{col 37}{space 1}    4.11{col 46}{space 3}0.000{col 54}{space 4} .0000749{col 67}{space 3} .0002111
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}


Total effects
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}      OIM
{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural  {col 14}{txt}{c |}
{space 2}{col 3}MD        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .1073375{col 26}{space 2} .0433895{col 37}{space 1}    2.47{col 46}{space 3}0.013{col 54}{space 4} .0222957{col 67}{space 3} .1923794
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}  .076773{col 26}{space 2} .0201589{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0372622{col 67}{space 3} .1162838
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2} .0097077{col 26}{space 2} .0124199{col 37}{space 1}    0.78{col 46}{space 3}0.434{col 54}{space 4}-.0146349{col 67}{space 3} .0340503
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0022368{col 26}{space 2} .0056105{col 37}{space 1}    0.40{col 46}{space 3}0.690{col 54}{space 4}-.0087595{col 67}{space 3} .0132331
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} .0000698{col 26}{space 2} .0000209{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .0000289{col 67}{space 3} .0001108
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0569732{col 26}{space 2} .0018537{col 37}{space 1}   30.73{col 46}{space 3}0.000{col 54}{space 4} .0533399{col 67}{space 3} .0606064
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0930231{col 26}{space 2}  .027018{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.1459773{col 67}{space 3}-.0400688
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0130162{col 26}{space 2} .0207971{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-.0277454{col 67}{space 3} .0537778
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0219439{col 26}{space 2} .0122865{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4} -.046025{col 67}{space 3} .0021371
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0000855{col 26}{space 2} .0001457{col 37}{space 1}   -0.59{col 46}{space 3}0.557{col 54}{space 4}-.0003711{col 67}{space 3} .0002001
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ISOVF     {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}  .108733{col 26}{space 2} .0435093{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .0234564{col 67}{space 3} .1940096
{txt}{space 8}PROT {c |}{col 14}{res}{space 2} .0918878{col 26}{space 2} .0201085{col 37}{space 1}    4.57{col 46}{space 3}0.000{col 54}{space 4} .0524758{col 67}{space 3} .1312998
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0042906{col 26}{space 2} .0124544{col 37}{space 1}   -0.34{col 46}{space 3}0.730{col 54}{space 4}-.0287007{col 67}{space 3} .0201195
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0030444{col 26}{space 2}  .005626{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4}-.0140712{col 67}{space 3} .0079824
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} .0001523{col 26}{space 2}  .000021{col 37}{space 1}    7.27{col 46}{space 3}0.000{col 54}{space 4} .0001113{col 67}{space 3} .0001934
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0550317{col 26}{space 2} .0018589{col 37}{space 1}   29.60{col 46}{space 3}0.000{col 54}{space 4} .0513884{col 67}{space 3}  .058675
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0833696{col 26}{space 2} .0270929{col 37}{space 1}   -3.08{col 46}{space 3}0.002{col 54}{space 4}-.1364707{col 67}{space 3}-.0302685
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0289175{col 26}{space 2} .0208548{col 37}{space 1}    1.39{col 46}{space 3}0.166{col 54}{space 4}-.0119572{col 67}{space 3} .0697922
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0231779{col 26}{space 2} .0123206{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4}-.0473258{col 67}{space 3}   .00097
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0003711{col 26}{space 2} .0001461{col 37}{space 1}   -2.54{col 46}{space 3}0.011{col 54}{space 4}-.0006575{col 67}{space 3}-.0000847
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}ICVF      {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} -.076447{col 26}{space 2} .0456751{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 54}{space 4}-.1659685{col 67}{space 3} .0130745
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}-.0405765{col 26}{space 2} .0212604{col 37}{space 1}   -1.91{col 46}{space 3}0.056{col 54}{space 4}-.0822461{col 67}{space 3} .0010931
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0162273{col 26}{space 2} .0130695{col 37}{space 1}   -1.24{col 46}{space 3}0.214{col 54}{space 4} -.041843{col 67}{space 3} .0093884
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0073149{col 26}{space 2} .0059039{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0188863{col 67}{space 3} .0042565
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} 5.27e-06{col 26}{space 2}  .000022{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-.0000378{col 67}{space 3} .0000484
{txt}{space 9}AGE {c |}{col 14}{res}{space 2}-.0371294{col 26}{space 2} .0019507{col 37}{space 1}  -19.03{col 46}{space 3}0.000{col 54}{space 4}-.0409526{col 67}{space 3}-.0333061
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0239925{col 26}{space 2}  .028431{col 37}{space 1}   -0.84{col 46}{space 3}0.399{col 54}{space 4}-.0797163{col 67}{space 3} .0317312
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0051842{col 26}{space 2} .0218848{col 37}{space 1}    0.24{col 46}{space 3}0.813{col 54}{space 4}-.0377093{col 67}{space 3} .0480776
{txt}{space 10}HS {c |}{col 14}{res}{space 2}  .021468{col 26}{space 2} .0129291{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0038726{col 67}{space 3} .0468085
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0000967{col 26}{space 2} .0001533{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.0003972{col 67}{space 3} .0002039
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}OD        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}  .068066{col 26}{space 2} .0474826{col 37}{space 1}    1.43{col 46}{space 3}0.152{col 54}{space 4}-.0249983{col 67}{space 3} .1611302
{txt}{space 8}PROT {c |}{col 14}{res}{space 2} .0766155{col 26}{space 2} .0219503{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .0335937{col 67}{space 3} .1196374
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2} .0111483{col 26}{space 2} .0135856{col 37}{space 1}    0.82{col 46}{space 3}0.412{col 54}{space 4} -.015479{col 67}{space 3} .0377756
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0116407{col 26}{space 2}  .006137{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-.0003877{col 67}{space 3} .0236691
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} .0002303{col 26}{space 2} .0000229{col 37}{space 1}   10.07{col 46}{space 3}0.000{col 54}{space 4} .0001855{col 67}{space 3} .0002752
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0226175{col 26}{space 2} .0020277{col 37}{space 1}   11.15{col 46}{space 3}0.000{col 54}{space 4} .0186433{col 67}{space 3} .0265918
{txt}{space 9}SEX {c |}{col 14}{res}{space 2} .0322065{col 26}{space 2} .0295538{col 37}{space 1}    1.09{col 46}{space 3}0.276{col 54}{space 4}-.0257179{col 67}{space 3} .0901309
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0666506{col 26}{space 2} .0227491{col 37}{space 1}   -2.93{col 46}{space 3}0.003{col 54}{space 4} -.111238{col 67}{space 3}-.0220632
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0024964{col 26}{space 2} .0134397{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}-.0288377{col 67}{space 3} .0238449
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0009731{col 26}{space 2} .0001594{col 37}{space 1}   -6.11{col 46}{space 3}0.000{col 54}{space 4}-.0012855{col 67}{space 3}-.0006607
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PD        {col 14}{c |}
{space 4}QUARTER0 {c |}{col 14}{res}{space 2} .0031886{col 26}{space 2} .0041904{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4}-.0050245{col 67}{space 3} .0114016
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0009616{col 26}{space 2} .0018929{col 37}{space 1}    0.51{col 46}{space 3}0.611{col 54}{space 4}-.0027485{col 67}{space 3} .0046717
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2} 1.01e-06{col 26}{space 2} 7.05e-06{col 37}{space 1}    0.14{col 46}{space 3}0.886{col 54}{space 4}-.0000128{col 67}{space 3} .0000148
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0080502{col 26}{space 2} .0006254{col 37}{space 1}   12.87{col 46}{space 3}0.000{col 54}{space 4} .0068244{col 67}{space 3}  .009276
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0123228{col 26}{space 2} .0091157{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-.0301892{col 67}{space 3} .0055437
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0392318{col 26}{space 2} .0070168{col 37}{space 1}   -5.59{col 46}{space 3}0.000{col 54}{space 4}-.0529845{col 67}{space 3} -.025479
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0061473{col 26}{space 2} .0041454{col 37}{space 1}    1.48{col 46}{space 3}0.138{col 54}{space 4}-.0019775{col 67}{space 3} .0142721
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0002362{col 26}{space 2} .0000492{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-.0003326{col 67}{space 3}-.0001399
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}PROT      {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}  .226579{col 26}{space 2} .0547534{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .1192644{col 67}{space 3} .3338937
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0042225{col 26}{space 2} .0156685{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.0349322{col 67}{space 3} .0264871
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0062948{col 26}{space 2} .0070811{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4} -.007584{col 67}{space 3} .0201735
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0000257{col 26}{space 2} .0000264{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-.0000774{col 67}{space 3}  .000026
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0568149{col 26}{space 2} .0024359{col 37}{space 1}   23.32{col 46}{space 3}0.000{col 54}{space 4} .0520406{col 67}{space 3} .0615891
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.1439897{col 26}{space 2} .0341298{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.2108828{col 67}{space 3}-.0770965
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0813463{col 26}{space 2} .0263113{col 37}{space 1}   -3.09{col 46}{space 3}0.002{col 54}{space 4}-.1329156{col 67}{space 3}-.0297771
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0353337{col 26}{space 2} .0155233{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.0657588{col 67}{space 3}-.0049086
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0014593{col 26}{space 2} .0001843{col 37}{space 1}   -7.92{col 46}{space 3}0.000{col 54}{space 4}-.0018205{col 67}{space 3}-.0010982
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Measurement {col 14}{txt}{c |}
{space 2}{col 3}M1        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}  .226579{col 26}{space 2} .0547534{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .1192644{col 67}{space 3} .3338937
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0042225{col 26}{space 2} .0156685{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.0349322{col 67}{space 3} .0264871
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0062948{col 26}{space 2} .0070811{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4} -.007584{col 67}{space 3} .0201735
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0000257{col 26}{space 2} .0000264{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-.0000774{col 67}{space 3}  .000026
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0568149{col 26}{space 2} .0024359{col 37}{space 1}   23.32{col 46}{space 3}0.000{col 54}{space 4} .0520406{col 67}{space 3} .0615891
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.1439897{col 26}{space 2} .0341298{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.2108828{col 67}{space 3}-.0770965
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0813463{col 26}{space 2} .0263113{col 37}{space 1}   -3.09{col 46}{space 3}0.002{col 54}{space 4}-.1329156{col 67}{space 3}-.0297771
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0353337{col 26}{space 2} .0155233{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.0657588{col 67}{space 3}-.0049086
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0014593{col 26}{space 2} .0001843{col 37}{space 1}   -7.92{col 46}{space 3}0.000{col 54}{space 4}-.0018205{col 67}{space 3}-.0010982
{space 2}{txt}{hline 11}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}M2        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2} .1995701{col 26}{space 2} .0481889{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .1051216{col 67}{space 3} .2940187
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}  .880797{col 26}{space 2} .0196626{col 37}{space 1}   44.80{col 46}{space 3}0.000{col 54}{space 4} .8422591{col 67}{space 3} .9193349
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0037192{col 26}{space 2} .0138001{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-.0307668{col 67}{space 3} .0233284
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2} .0055444{col 26}{space 2} .0062345{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4}-.0066749{col 67}{space 3} .0177637
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0000226{col 26}{space 2} .0000232{col 37}{space 1}   -0.97{col 46}{space 3}0.330{col 54}{space 4}-.0000682{col 67}{space 3} .0000229
{txt}{space 9}AGE {c |}{col 14}{res}{space 2} .0500424{col 26}{space 2} .0021318{col 37}{space 1}   23.47{col 46}{space 3}0.000{col 54}{space 4} .0458642{col 67}{space 3} .0542205
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.1268257{col 26}{space 2} .0300485{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.1857196{col 67}{space 3}-.0679317
{txt}{space 9}SES {c |}{col 14}{res}{space 2}-.0716496{col 26}{space 2} .0231107{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.1169457{col 67}{space 3}-.0263535
{txt}{space 10}HS {c |}{col 14}{res}{space 2}-.0311218{col 26}{space 2} .0137146{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4} -.058002{col 67}{space 3}-.0042416
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2}-.0012854{col 26}{space 2} .0001642{col 37}{space 1}   -7.83{col 46}{space 3}0.000{col 54}{space 4}-.0016072{col 67}{space 3}-.0009636
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural  {col 14}{txt}{c |}
{space 2}{col 3}FA        {col 14}{c |}
{space 10}PD {c |}{col 14}{res}{space 2}-.1325794{col 26}{space 2} .0445818{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-.2199581{col 67}{space 3}-.0452006
{txt}{space 8}PROT {c |}{col 14}{res}{space 2}-.0794393{col 26}{space 2} .0206782{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4}-.1199679{col 67}{space 3}-.0389107
{txt}{space 4}QUARTER0 {c |}{col 14}{res}{space 2}-.0165113{col 26}{space 2} .0127649{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4}-.0415301{col 67}{space 3} .0085075
{txt}{space 5}FASTING {c |}{col 14}{res}{space 2}-.0101579{col 26}{space 2} .0057663{col 37}{space 1}   -1.76{col 46}{space 3}0.078{col 54}{space 4}-.0214597{col 67}{space 3} .0011439
{txt}{space 3}TIME_V0V2 {c |}{col 14}{res}{space 2}-.0001464{col 26}{space 2} .0000215{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.0001885{col 67}{space 3}-.0001043
{txt}{space 9}AGE {c |}{col 14}{res}{space 2}-.0459035{col 26}{space 2} .0019052{col 37}{space 1}  -24.09{col 46}{space 3}0.000{col 54}{space 4}-.0496376{col 67}{space 3}-.0421693
{txt}{space 9}SEX {c |}{col 14}{res}{space 2}-.0790412{col 26}{space 2} .0277685{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-.1334665{col 67}{space 3} -.024616
{txt}{space 9}SES {c |}{col 14}{res}{space 2} .0597215{col 26}{space 2} .0213748{col 37}{space 1}    2.79{col 46}{space 3}0.005{col 54}{space 4} .0178276{col 67}{space 3} .1016155
{txt}{space 10}HS {c |}{col 14}{res}{space 2} .0222074{col 26}{space 2} .0126278{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0025426{col 67}{space 3} .0469574
{txt}{space 9}LE8 {c |}{col 14}{res}{space 2} .0007796{col 26}{space 2} .0001498{col 37}{space 1}    5.21{col 46}{space 3}0.000{col 54}{space 4}  .000486{col 67}{space 3} .0010731
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}